Repository: vim-doc-es/vimdocs
Catalog: 7.3/recursos_de_traduccion/doc-compendium.tmx
Source language: en
Languages: es_es

source: The "." is used to concatenate the string "tag " with the value of variable "tag_name". Suppose "tag_name" has the value "get_cmd", then the command that will be executed is: >
es_es: El «.» se usa para concatenar la cadena «tag » con el valor de la variable «nombre_etiqueta». Si suponemos que «nombre_etiqueta» tiene el contenido «obtener_orden», entonces la orden que se ejecutará es: >

source: :tag get_cmd
es_es: :tag obtener_orden

source: The ":execute" command can only execute colon commands. The ":normal" command executes Normal mode commands. However, its argument is not an expression but the literal command characters. Example: >
es_es: La orden «:execute» sólo puede ejecutar órdenes de la línea de órdenes (órdenes Ex, que empiezan con «:»). La orden «:normal» ejecuta órdenes del modo Normal. Sin embargo, su argumento no es una expresión, sino los caracteres literales de la orden. Ejemplo: >

source: This jumps to the first line and formats all lines with the "=" operator. To make ":normal" work with an expression, combine ":execute" with it. Example: >
es_es: Se mueve hasta la primera línea y formatea todas las líneas usando el operador «=». Para usar «:normal» con el resultado de una expresión, debe combinar «:execute» con dicha orden. Ejemplo: >

source: :execute "normal " . normal_commands
es_es: :execute "normal " . ordenes_modo_normal

source: The variable "normal_commands" must contain the Normal mode commands. Make sure that the argument for ":normal" is a complete command. Otherwise Vim will run into the end of the argument and abort the command. For example, if you start Insert mode, you must leave Insert mode as well. This works: >
es_es: La variables «ordenes_modo_normal» debe contener órdenes para el modo Normal. Asegúrese de que el argumento para «:normal» es una orden completa. En caso contrario, Vim llegará al final del argumento e interrumpirá la orden. Por ejemplo, si inicia el modo Insertar, debe salir del mismo. Lo siguiente funciona adecuadamente: >

source: :execute "normal Inew text \<Esc>"
es_es: :execute "normal Itexto nuevo \<Esc>"

source: This inserts "new text " in the current line. Notice the use of the special key "\<Esc>". This avoids having to enter a real <Esc> character in your script.
es_es: Esta orden inserta «texto nuevo» en la línea actual. Observe el uso de la tecla especial «\<Esc>». Así se evita la necesidad de escribir un <Esc> real en el script.

source: :let optname = "path" :let optval = eval('&' . optname)
es_es: :let nomopcion = "path" :let valopcion = eval('&' . nomopcion)

source: A "&" character is prepended to "path", thus the argument to eval() is "&path". The result will then be the value of the 'path' option. The same thing can be done with: > :exe 'let optval = &' . optname
es_es: Se antepone un «&» a «path», y así el argumento para eval() es «&path». El resultado será el valor de la opción 'path'. Puede obtener el mismo resultado con: > :exe 'let optval = &' . optname

source: *41.6* Using functions
es_es: *24.1* Funciones

source: Vim defines many functions and provides a large amount of functionality that way. A few examples will be given in this section. You can find the whole list here: |functions|.
es_es: Vim define muchas funciones y provee bastante funcionalidad a través de este mecanismo. Aquí daremos algunos ejemplos. La referencia para la lista completa se encuentra en |functions|.

source: A function is called with the ":call" command. The parameters are passed in between braces, separated by commas. Example: >
es_es: Las funciones se llaman con la orden «:call». Los parámetros se introducen entre paréntesis, separados por comas. Ejemplo: >

source: :call search("Date: ", "W")
es_es: :call search("Fecha: ", "W")

source: This calls the search() function, with arguments "Date: " and "W". The search() function uses its first argument as a search pattern and the second one as flags. The "W" flag means the search doesn't wrap around the end of the file.
es_es: Se invoca a la función search(), con los argumentos «Fecha: » y «W». La función search() usa su primer argumento como patrón de búsqueda y el segundo como una serie de opciones. La opción «W» hace que la búsqueda termine al alcanzar el final del archivo.

source: A function can be called in an expression. Example: >
es_es: También es posible invocar funciones en expresiones. Ejemplo: >

source: :let line = getline(".") :let repl = substitute(line, '\a', "*", "g") :call setline(".", repl)
es_es: :let linea = getline(".") :let reempl = substitute(linea, '\a', "*", "g") :call setline(".", reempl)

source: FUNCTIONS *function-list*
es_es: FUNCIONES *function-list*

source: There are many functions. We will mention them here, grouped by what they are used for. You can find an alphabetical list here: |functions|. Use CTRL-] on the function name to jump to detailed help on it.
es_es: Vim cuenta con muchas funciones. Las mencionaremos aquí, agrupadas de acuerdo a su funcionalidad. En |functions| se encuentra una lista de ellas ordenada alfabéticamente. Puede ubicar el cursor sobre el nombre de una función y pulsar CTRL-] para ver documentación más detallada sobre ella.

source: String manipulation: *string-functions* nr2char() get a character by its ASCII value char2nr() get ASCII value of a character str2nr() convert a string to a Number str2float() convert a string to a Float printf() format a string according to % items escape() escape characters in a string with a '\' shellescape() escape a string for use with a shell command fnameescape() escape a file name for use with a Vim command tr() translate characters from one set to another strtrans() translate a string to make it printable tolower() turn a string to lowercase toupper() turn a string to uppercase match() position where a pattern matches in a string matchend() position where a pattern match ends in a string matchstr() match of a pattern in a string matchlist() like matchstr() and also return submatches stridx() first index of a short string in a long string strridx() last index of a short string in a long string strlen() length of a string substitute() substitute a pattern match with a string submatch() get a specific match in a ":substitute" strpart() get part of a string expand() expand special keywords iconv() convert text from one encoding to another byteidx() byte index of a character in a string repeat() repeat a string multiple times eval() evaluate a string expression
es_es: Manipulación de cadenas: *string-functions* nr2char() obtiene un carácter dado su valor ASCII char2nr() obtiene el número ASCII del carácter dado str2nr() convierte una cadena a Número str2float() convierte una cadena a Flotante printf() formatea una cadena de acuerdo a elementos % escape() escapa caracteres en una cadena con '\' shellescape() escapa una cadena para usarse una orden de consola fnameescape() escapa un nombre de archivo para usar en una orden Vim tr() traduce caracteres de un conjunto a otro strtrans() traduce una cadena para que se pueda imprimir tolower() convierte una cadena a minúsculas toupper() convierte una cadena a mayúsculas match() posición en la que un patrón coincide en una cadena matchend() posición en la que un patrón termina en una cadena matchstr() coincidencia de un patrón en una cadena matchlist() similar a matchstr() y retorna subcoincidencias stridx() primer índice de una cadena corta dentro de una larga strridx() último índice de una cadena corta dentro de una larga strlen() longitud de una cadena substitute() sustituye la coincidencia de un patrón con una cadena submatch() obtiene una subcoincidencia específica en un «:substitute» strpart() obtiene parte de una cadena expand() expande palabras clave iconv() convierte texto entre distintas codificaciones byteidx() índice de byte de un carácter en una cadena repeat() repite una cadena múltiples veces eval() evalúa una cadena como expresión

source: List manipulation: *list-functions* get() get an item without error for wrong index len() number of items in a List empty() check if List is empty insert() insert an item somewhere in a List add() append an item to a List extend() append a List to a List remove() remove one or more items from a List copy() make a shallow copy of a List deepcopy() make a full copy of a List filter() remove selected items from a List map() change each List item sort() sort a List reverse() reverse the order of a List split() split a String into a List join() join List items into a String range() return a List with a sequence of numbers string() String representation of a List call() call a function with List as arguments index() index of a value in a List max() maximum value in a List min() minimum value in a List count() count number of times a value appears in a List repeat() repeat a List multiple times
es_es: Manipulación de Listas: *list-functions* get() obtiene un elemento sin generar error al usar índices erróneos len() número de elementos en una Lista empty() comprueba si una Lista está vacía insert() inserta un elemento en una Lista add() añade un elemento a una Lista extend() añade los contenidos de una Lista a otra Lista remove() elimina uno o más elementos de una lista copy() hace una copia superficial de una Lista deepcopy() hace una copia completa de una Lista filter() elimina elementos particulares de una Lista map() cambia cada elemento de una Lista sort() ordena una Lista reverse() invierte el orden de una Lista split() divide una cadena en una Lista join() une los elementos de una Lista en una cadena range() retorna una Lista con una secuencia de números string() representación de una Lista en una cadena call() invoca una función con una Lista como argumentos index() índice de un valor en una Lista max() valor máximo en una Lista min() valor mínimo en una Lista count() cuenta la cantidad de veces que un valor aparece en una Lista repeat() repite una Lista múltiples veces

source: Dictionary manipulation: *dict-functions* get() get an entry without an error for a wrong key len() number of entries in a Dictionary has_key() check whether a key appears in a Dictionary empty() check if Dictionary is empty remove() remove an entry from a Dictionary extend() add entries from one Dictionary to another filter() remove selected entries from a Dictionary map() change each Dictionary entry keys() get List of Dictionary keys values() get List of Dictionary values items() get List of Dictionary key-value pairs copy() make a shallow copy of a Dictionary deepcopy() make a full copy of a Dictionary string() String representation of a Dictionary max() maximum value in a Dictionary min() minimum value in a Dictionary count() count number of times a value appears
es_es: Manipulación de Diccionarios: *dict-functions* get() obtiene una entrada sin generar error al usar claves erróneas len() número de entradas en un Diccionario has_key() comprueba si una clave aparece en un Diccionario empty() comprueba si un Diccionario está vacío remove() elimina una entrada de un Diccionario extend() añade las entradas de un Diccionario a otro filter() elimina entradas particulares de un Diccionario map() cambia cada entrada de un Diccionario keys() devuelve una Lista con las claves de un Diccionario values() devuelve una Lista con los valores de un Diccionario items() devuelve una Lista de pares clave-valor de un Diccionario copy() hace una copia superficial de un Diccionario deepcopy() hace una copia completa de un Diccionario string() representación de cadena de un Diccionario max() valor máximo en un Diccionario min() valor mínimo en un Diccionario count() cuenta la cantidad de veces que un valor aparece en un Diccionario

source: Floating point computation: *float-functions* float2nr() convert Float to Number abs() absolute value (also works for Number) round() round off ceil() round up floor() round down trunc() remove value after decimal point log10() logarithm to base 10 pow() value of x to the exponent y sqrt() square root sin() sine cos() cosine atan() arc tangent
es_es: Operaciones de punto flotante: *float-functions* float2nr() convertir Flotante a Número abs() valor absoluto (también funciona para Números) round() redondear ceil() redondear hacia arriba (techo) floor() redondear hacia abajo (piso) trunc() eliminar valores después del punto decimal log10() logaritmo en base 10 pow() valor de x elevado a la y potencia sqrt() raíz cuadrada sin() seno cos() coseno atan() arcotangente

source: Variables: *var-functions* type() type of a variable islocked() check if a variable is locked function() get a Funcref for a function name getbufvar() get a variable value from a specific buffer setbufvar() set a variable in a specific buffer getwinvar() get a variable from specific window gettabvar() get a variable from specific tab page gettabwinvar() get a variable from specific window & tab page setwinvar() set a variable in a specific window settabvar() set a variable in a specific tab page settabwinvar() set a variable in a specific window & tab page garbagecollect() possibly free memory
es_es: Variables: *var-functions* type() tipo de una variable islocked() comprueba si una variable ha sido bloqueada function() obtiene una referencia a función para el nombre de función dado getbufvar() obtiene una variable de un búfer específico setbufvar() define una variable en un búfer específico getwinvar() obtiene una variable de una ventana específica gettabvar() obtiene una variable de una pestaña específica gettabwinvar() obtiene una variable de una ventana y pestaña específicas setwinvar() define una variable en una ventana específica settabvar() define una variable en una pestaña específica settabwinvar() define una variable en una ventana y pestaña específicas garbagecollect() potencialmente libera memoria

source: Cursor and mark position: *cursor-functions* *mark-functions* col() column number of the cursor or a mark virtcol() screen column of the cursor or a mark line() line number of the cursor or mark wincol() window column number of the cursor winline() window line number of the cursor cursor() position the cursor at a line/column getpos() get position of cursor, mark, etc. setpos() set position of cursor, mark, etc. byte2line() get line number at a specific byte count line2byte() byte count at a specific line diff_filler() get the number of filler lines above a line
es_es: Posición de marcas y del cursor: *cursor-functions* *mark-functions* col() número de columna del cursor o de una marca virtcol() número de columna en pantalla del cursor o de una marca line() número de línea del cursor o de una marca wincol() número de columna de ventana del cursor winline() número de línea de ventana del cursor cursor() ubica el cursor en una linea/columna getpos() obtiene la posición del cursor, marca, etc. setpos() define la posición del cursor, marca, etc. byte2line() obtiene el número de línea correspondiente a un índice en bytes line2byte() índice en bytes correspondiente a una línea específica diff_filler() obtiene la cantidad de líneas de relleno encima de una línea

source: Working with text in the current buffer: *text-functions* getline() get a line or list of lines from the buffer setline() replace a line in the buffer append() append line or list of lines in the buffer indent() indent of a specific line cindent() indent according to C indenting lispindent() indent according to Lisp indenting nextnonblank() find next non-blank line prevnonblank() find previous non-blank line search() find a match for a pattern searchpos() find a match for a pattern searchpair() find the other end of a start/skip/end searchpairpos() find the other end of a start/skip/end searchdecl() search for the declaration of a name
es_es: Manipulación de texto en el búfer actual: *text-functions* getline() obtiene una línea o lista de líneas del búfer setline() reemplaza una línea del búfer append() añade una línea o lista de líneas al búfer indent() sangrado de una línea específica cindent() sangrado de una línea de acuerdo al estilo para C lispindent() sangrado de una línea de acuerdo al estilo para Lisp nextnonblank() ubica la siguiente línea no vacía prevnonblank() ubica la anterior línea no vacía search() ubica una coincidencia para un patrón searchpos() ubica una coincidencia para un patrón searchpair() ubica la parte correspondiente a un inicio/medio/final searchpairpos() ubica la parte correspondiente a un inicio/medio/final searchdecl() busca la declaración de un nombre

source: *system-functions* *file-functions* System functions and manipulation of files: glob() expand wildcards globpath() expand wildcards in a number of directories findfile() find a file in a list of directories finddir() find a directory in a list of directories resolve() find out where a shortcut points to fnamemodify() modify a file name pathshorten() shorten directory names in a path simplify() simplify a path without changing its meaning executable() check if an executable program exists filereadable() check if a file can be read filewritable() check if a file can be written to getfperm() get the permissions of a file getftype() get the kind of a file isdirectory() check if a directory exists getfsize() get the size of a file getcwd() get the current working directory haslocaldir() check if current window used |:lcd| tempname() get the name of a temporary file mkdir() create a new directory delete() delete a file rename() rename a file system() get the result of a shell command hostname() name of the system readfile() read a file into a List of lines writefile() write a List of lines into a file
es_es: *system-functions* *file-functions* Funciones del sistema y manipulación de archivos: glob() expande comodines globpath() expande comodines en múltiples directorios findfile() ubica un archivo en una lista de directorios finddir() ubica un directorio en una lista de directorios resolve() determina a dónde apunta un acceso o enlace directo fnamemodify() modifica un nombre de archivo pathshorten() abrevia nombres de directorio en una ruta simplify() simplifica una ruta sin cambiar su significado executable() comprueba si un programa ejecutable existe filereadable() comprueba si se puede leer un archivo filewritable() comprueba si se puede escribir a un archivo getfperm() obtiene los permisos para un archivo getftype() obtiene el tipo de un archivo isdirectory() comprueba si un directorio existe getfsize() obtiene el tamaño de un archivo getcwd() obtiene el directorio de trabajo actual haslocaldir() comprueba si se ha usado |:lcd| en la ventana actual tempname() obtiene un nombre para un archivo temporal mkdir() crea un nuevo directorio delete() borra un archivo rename() renombra un archivo system() obtiene el resultado de una orden de consola hostname() nombre del sistema readfile() lee un archivo y devuelve una Lista de líneas writefile() escribe una Lista de líneas a un archivo

source: Date and Time: *date-functions* *time-functions* getftime() get last modification time of a file localtime() get current time in seconds strftime() convert time to a string reltime() get the current or elapsed time accurately reltimestr() convert reltime() result to a string
es_es: Fecha y Hora: *date-functions* *time-functions* getftime() obtiene la hora de la última modificación de un archivo localtime() obtiene la hora actual en segundos strftime() convierte la hora a una cadena reltime() devuelve la hora actual o el tiempo transcurrido desde una hora reltimestr() convierte el resultado de reltime() a una cadena

source: *buffer-functions* *window-functions* *arg-functions* Buffers, windows and the argument list: argc() number of entries in the argument list argidx() current position in the argument list argv() get one entry from the argument list bufexists() check if a buffer exists buflisted() check if a buffer exists and is listed bufloaded() check if a buffer exists and is loaded bufname() get the name of a specific buffer bufnr() get the buffer number of a specific buffer tabpagebuflist() return List of buffers in a tab page tabpagenr() get the number of a tab page tabpagewinnr() like winnr() for a specified tab page winnr() get the window number for the current window bufwinnr() get the window number of a specific buffer winbufnr() get the buffer number of a specific window getbufline() get a list of lines from the specified buffer
es_es: *buffer-functions* *window-functions* *arg-functions* Búferes, ventanas, y la lista de argumentos: argc() número de entradas en la lista de argumentos argidx() posición actual en la lista de argumentos argv() obtiene un elemento de la lista de argumentos bufexists() comprueba si un búfer existe buflisted() comprueba si un búfer existe y está listado bufloaded() comprueba si un búfer existe y está cargado bufname() obtiene el nombre de un búfer específico bufnr() obtiene el número de búfer de un búfer específico tabpagebuflist() devuelve la Lista de búfers de una pestaña tabpagenr() obtiene el número de una pestaña tabpagewinnr() similar a winnr(), pero especificando la pestaña winnr() obtiene el número de ventana de la ventana actual bufwinnr() obtiene el número de ventana del búfer especificado winbufnr() obtiene el número de búfer de una ventana específica getbufline() obtiene una lista de líneas del búfer especificado

source: Command line: *command-line-functions* getcmdline() get the current command line getcmdpos() get position of the cursor in the command line setcmdpos() set position of the cursor in the command line getcmdtype() return the current command-line type
es_es: Línea de órdenes: *command-line-functions* getcmdline() obtiene la línea de órdenes actual getcmdpos() obtiene la posición del cursor en la línea de órdenes setcmdpos() cambia la posición del cursor en la línea de órdenes getcmdtype() devuelve el tipo de la línea de órdenes actual

source: Quickfix and location lists: *quickfix-functions* getqflist() list of quickfix errors setqflist() modify a quickfix list getloclist() list of location list items setloclist() modify a location list
es_es: Listas de corrección rápida y de ubicación: *quickfix-functions* getqflist() obtiene una lista de errores de corrección rápida setqflist() modifica una lista de corrección rápida getloclist() obtiene la lista de elementos de una lista de ubicación setloclist() modifica una lista de ubicación

source: Insert mode completion: *completion-functions* complete() set found matches complete_add() add to found matches complete_check() check if completion should be aborted pumvisible() check if the popup menu is displayed
es_es: Completado automático en modo Insertar: *completion-functions* complete() define coincidencias encontradas complete_add() añade elementos a la lista de coincidencias encontradas complete_check() comprueba si debería interrumpir el completado pumvisible() comprueba si se está mostrando el menú contextual

source: Folding: *folding-functions* foldclosed() check for a closed fold at a specific line foldclosedend() like foldclosed() but return the last line foldlevel() check for the fold level at a specific line foldtext() generate the line displayed for a closed fold foldtextresult() get the text displayed for a closed fold
es_es: Plegado: *folding-functions* foldclosed() comprueba si hay un pliegue cerrado en una línea específica foldclosedend() similar a foldclosed() pero devuelve la última línea foldlevel() obtiene el nivel de plegado de la línea especificada foldtext() genera el texto mostrado en un pliegue cerrado foldtextresult() obtiene el texto mostrado en un pliegue cerrado
